test/reserve_without_headers.xml

<soapenv:Envelope xmlns:type="http://schemas.ogf.org/nsi/2013/07/connection/types" xmlns:head="http://schemas.ogf.org/nsi/2013/07/framework/headers" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <type:reserve>
            <globalReservationId />
            <description>A NSI reserve test</description>
            <criteria version="0">
                <schedule>
                    <startTime>2013-07-24T16:50:00.000+02:00</startTime>
                    <endTime>2013-07-24T17:00:00.000+02:00</endTime>
                </schedule>
                <p2p:p2ps xmlns:p2p="http://schemas.ogf.org/nsi/2013/07/services/point2point">
                    <capacity>100</capacity>
                    <directionality>Bidirectional</directionality>
                    <sourceSTP>
                        <networkId>urn:ogf:network:stp:surfnet.nl</networkId>
                        <localId>21</localId>
                    </sourceSTP>
                    <destSTP>
                        <networkId>urn:ogf:network:stp:surfnet.nl</networkId>
                        <localId>24</localId>
                    </destSTP>
                </p2p:p2ps>
            </criteria>
        </type:reserve>
    </soapenv:Body>
</soapenv:Envelope>
